flowmis-os-install.org
:Einstellungen:
#+STARTUP: folded hideblocks shrink
#+begin_src shell
# mkdir ~/.config/doom/ ~/.config/doom/ ~/.config/doom/banner/ ~/.config/doom/themes/ ~/.config/doom/eshell/
cp -u ~/flowmis-os/tangle/config.el ~/.config/doom/config.el && cp -u ~/flowmis-os/tangle/init.el ~/.config/doom/init.el && cp -u ~/flowmis-os/tangle/packages.el ~/.config/doom/packages.el && cp -u ~/flowmis-os/tangle/start.org ~/.config/doom/start.org && cp -R ~/flowmis-os/tangle/banner/ ~/.config/doom/ && cp -R ~/flowmis-os/tangle/themes/ ~/.config/doom/ && cp -R ~/flowmis-os/tangle/eshell/ ~/.config/doom/ && echo '###########################Doom ready###########################'
cp -u ~/flowmis-os/tangle/config.py ~/.config/qtile/config.py && cp -u ~/flowmis-os/tangle/python-white.png ~/.config/qtile/pyhton-white.png && echo '###########################Qtile ready###########################'
# cp -u ~/flowmis-os/tangle/launcher.sh ~/.config/rofi/launchers/misc/launcher.sh
# cp -u ~/flowmis-os/tangle/mane.rasi ~/.config/rofi/launchers/misc/mane.rasi
# cp -u ~/flowmis-os/tangle/config.rasi ~/.config/rofi/config.rasi
# cp -u ~/flowmis-os/tangle/.xprofile ~/.xprofile
# cp -u ~/flowmis-os/tangle/.Xressources ~/.Xressources
# cp -u ~/flowmis-os/tangle/.bashrc ~/.bashrc
# cp -u ~/flowmis-os/tangle/alacritty.yml ~/.config/alacritty/alacritty.yml
# cp -u ~/flowmis-os/tangle/config.fish ~/.config/fish/config.fish
# cp -u ~/flowmis-os/tangle/.gitconfig ~/.gitconfig
cp -u ~/flowmis-os/tangle/picom.conf ~/.config/picom/picom.conf
echo done
#+end_src

#+RESULTS:
| ###########################Doom  | ready########################### |
| ###########################Qtile | ready########################### |
| done                             |                                  |

:END:
#+TITLE: Install flowmis-os
-------------------------------------------------------------------------------------------------------------------
- [[~/flowmis-os/flowmis-os.org][flowmis-os]]
-------------------------------------------------------------------------------------------------------------------

* Installation flowmis-os on Windows mit wsl
https://www.youtube.com/watch?v=h0Wg_aknGdc
* Installation

- [ ] Booted man auf den Stick wird man in eine virtuelle Konsole (handelt sich um eine Zsh Shell) als root eingeloggt, von der aus man die gewünschte Installation durchführen kann. Theoretisch kann man ein Autoinstallationsskript in die ISO mit einbauen und dann über die Zsh ausführen
- _Problemlösung:_
  - [[https://wiki.archlinux.org/title/Installation_guide][Arch InstallGuide]] bei Fragen/Problemen
  - Wenn ich feststecke kann ich mit <C-M-F2> in die tty wechseln und mit root und cli Einstellungen rückgängig machen -> C=Strg, M=Alt, F2 muss eventuell mit Fn zusammen gedrückt werden!
  - Etwas vergessen: kann nach der Installation erneut auf Bootstick booten und von diesem die Linux-Filesystem partition mounten und mit arch-chroot auf diese gehen und Dinge installieren (im root Modus und mit hoffentlich funktionierendem Internet)

** Installationsdateien

- Locales:

#+begin_src shell :tangle tangle/locale.conf
LANG=de_DE.UTF-8
LC_CTYPE=de_DE.UTF-8
#+end_src

- Localhost und die localdomain festlegen:

#+begin_src shell :tangle tangle/hosts
# Static table lookup for hostnames.
# See hosts(5) for detailsh
127.0.0.1    localhost
::1          localhost
127.0.1.1    FlowmisPC.localdomain    FlowmisPC
#+end_src

